<?php

/* ========================================================================
 * $Id: dialog.php 11874 2020-04-30 18:26:19Z onez $
 * 
 * Email: www@onez.cn
 * QQ: 6200103
 * HomePage: http://www.onezphp.com
 * ========================================================================
 * Copyright 2016-2017 佳蓝科技.
 * 
 * ======================================================================== */

!defined('IN_ONEZ') && exit('Access Denied');
#----------模板加载模式开始--------------
if($MODE=='TEMPLATE'){
  $TPL['records']=false;
  return $MODE;
}
#----------模板加载模式结束--------------
$A['title']='对话框';
$A['status']='dialog';
$A['actionShowBox']='';
$A['actionUserInfo']='';
#侧边栏
$sidebar=array();
$sidebar['user']=array(
  'userid'=>$G['userid'],
  'avatar'=>$G['this']->avatar($G['userid']),
  'nickname'=>$G['this']->user($G['userid'],'nickname'),
  'token'=>$G['this']->getEvent(array(
    'token'=>'userCard',
    'userid'=>$G['userid'],
  )),
);
$menus=array();
$menus[]=array(
  'icon'=>'<svg class="icon" style="width:128px;height:128px;fill:#12b7f5;" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"><path d="M512 64C264.576 64 64 250.624 64 480.768c0 116.736 57.152 238.784 199.744 310.848 0 48.128-45.632 120.32-91.392 168.384 136.896-12.032 196.864-46.976 245.504-71.808C448.32 894.144 479.616 897.6 512 897.6c247.36 0 448-186.56 448-416.896C960 250.624 759.36 64 512 64z" /></svg>',
  'icon2'=>'<svg class="icon" style="width:128px;height:128px;fill:#12b7f5;" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"><path d="M512 64C264.576 64 64 250.624 64 480.768c0 116.736 57.152 238.784 199.744 310.848 0 48.128-45.632 120.32-91.392 168.384 136.896-12.032 196.864-46.976 245.504-71.808C448.32 894.144 479.616 897.6 512 897.6c247.36 0 448-186.56 448-416.896C960 250.624 759.36 64 512 64z" fill="none" stroke="#12b7f5" stroke-width="40" /></svg>',
  'name'=>'聊天',
  'status'=>'dialog',
  'token'=>$G['this']->getEvent(array(
    'token'=>'set',
    'key'=>'status',
    'value'=>'dialog',
  )),
);
$menus[]=array(
  'icon'=>'<svg class="icon" style="width:128px;height:128px;fill:#12b7f5;" viewBox="0 0 1027 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"><path d="M776.904348 747.965217l-186.991304-73.46087c0 0-35.617391-13.356522-48.973913-26.713043-8.904348-8.904348-8.904348-28.93913 0-55.652174 8.904348-26.713043 104.626087-133.565217 104.626087-231.513043C643.33913 209.252174 545.391304 89.043478 422.956522 89.043478 300.521739 89.043478 202.573913 209.252174 202.573913 360.626087c0 93.495652 84.591304 204.8 95.721739 224.834783 11.130435 20.034783 8.904348 51.2 0 60.104348-13.356522 13.356522-57.878261 28.93913-57.878261 28.93913l-169.182609 75.686957c-40.069565 13.356522-71.234783 51.2-71.234783 93.495652l0 20.034783c0 46.747826 37.843478 73.46087 82.365217 73.46087l282.713043 0 97.947826 0 300.521739 0c46.747826 0 82.365217-28.93913 82.365217-73.46087l0-20.034783C848.13913 799.165217 816.973913 761.321739 776.904348 747.965217L776.904348 747.965217zM745.73913 434.086957c-20.034783 0-35.617391-8.904348-35.617391-31.165217 0-20.034783 15.582609-31.165217 35.617391-31.165217l247.095652 0c20.034783 0 33.391304 8.904348 33.391304 31.165217 0 20.034783-17.808696 31.165217-35.617391 31.165217L745.73913 434.086957 745.73913 434.086957zM796.93913 574.330435c-20.034783 0-35.617391-8.904348-35.617391-31.165217 0-20.034783 15.582609-31.165217 35.617391-31.165217l195.895652 0c20.034783 0 33.391304 8.904348 33.391304 31.165217 0 20.034783-15.582609 31.165217-33.391304 31.165217L796.93913 574.330435 796.93913 574.330435zM861.495652 705.669565c-20.034783 0-35.617391-8.904348-35.617391-31.165217s15.582609-31.165217 35.617391-31.165217l131.33913 0c20.034783 0 33.391304 8.904348 33.391304 31.165217 0 20.034783-15.582609 31.165217-35.617391 31.165217L861.495652 705.669565 861.495652 705.669565z" fill="#12b7f5" /></svg>',
  'icon2'=>'<svg class="icon" style="width:128px;height:128px" viewBox="0 0 1027 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"><path d="M776.904348 747.965217l-186.991304-73.46087c0 0-35.617391-13.356522-48.973913-26.713043-8.904348-8.904348-8.904348-28.93913 0-55.652174 8.904348-26.713043 104.626087-133.565217 104.626087-231.513043C643.33913 209.252174 545.391304 89.043478 422.956522 89.043478 300.521739 89.043478 202.573913 209.252174 202.573913 360.626087c0 93.495652 84.591304 204.8 95.721739 224.834783 11.130435 20.034783 8.904348 51.2 0 60.104348-13.356522 13.356522-57.878261 28.93913-57.878261 28.93913l-169.182609 75.686957c-40.069565 13.356522-71.234783 51.2-71.234783 93.495652l0 20.034783c0 46.747826 37.843478 73.46087 82.365217 73.46087l282.713043 0 97.947826 0 300.521739 0c46.747826 0 82.365217-28.93913 82.365217-73.46087l0-20.034783C848.13913 799.165217 816.973913 761.321739 776.904348 747.965217L776.904348 747.965217zM745.73913 434.086957c-20.034783 0-35.617391-8.904348-35.617391-31.165217 0-20.034783 15.582609-31.165217 35.617391-31.165217l247.095652 0c20.034783 0 33.391304 8.904348 33.391304 31.165217 0 20.034783-17.808696 31.165217-35.617391 31.165217L745.73913 434.086957 745.73913 434.086957zM796.93913 574.330435c-20.034783 0-35.617391-8.904348-35.617391-31.165217 0-20.034783 15.582609-31.165217 35.617391-31.165217l195.895652 0c20.034783 0 33.391304 8.904348 33.391304 31.165217 0 20.034783-15.582609 31.165217-33.391304 31.165217L796.93913 574.330435 796.93913 574.330435zM861.495652 705.669565c-20.034783 0-35.617391-8.904348-35.617391-31.165217s15.582609-31.165217 35.617391-31.165217l131.33913 0c20.034783 0 33.391304 8.904348 33.391304 31.165217 0 20.034783-15.582609 31.165217-35.617391 31.165217L861.495652 705.669565 861.495652 705.669565z" fill="none" stroke="#12b7f5" stroke-width="40" /></svg>',
  'name'=>'通讯录',
  'status'=>'contact',
  'token'=>$G['this']->getEvent(array(
    'token'=>'set',
    'key'=>'status',
    'value'=>'contact',
  )),
);
$sidebar['menus']=$menus;
$menus=array();
$menus[]=array(
  'icon'=>'<svg class="icon" style="width:128px;height:128px;fill:#12b7f5;" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"><path d="M832.2 264.6H192.3c-35.2 0-64-28.8-64-64s28.8-64 64-64h639.8c35.2 0 64 28.8 64 64 0.1 35.2-28.7 64-63.9 64zM832.2 577.9H196.1c-35.2 0-64-28.8-64-64s28.8-64 64-64h636.1c35.2 0 64 28.8 64 64s-28.8 64-64 64zM832.2 896.9H192.3c-35.2 0-64-28.8-64-64s28.8-64 64-64h639.8c35.2 0 64 28.8 64 64 0.1 35.2-28.7 64-63.9 64z" fill="#12b7f5" /></svg>',
  'name'=>'设置',
  'token'=>$G['this']->getEvent(array(
    'token'=>'show',
    'el'=>'.menu-setting',
  )),
);
$sidebar['setting']=$menus;

#工具条
$toolbar=array();
0 && $toolbar[]=array(
  'classname'=>'layui-icon layui-icon-face-smile-b',
  'name'=>'表情',
  'toolbar'=>'emote',
);
$toolbar[]=array(
  'classname'=>'layui-icon layui-icon-picture',
  'name'=>'图片',
  'toolbar'=>'image',
);
0 && $toolbar[]=array(
  'classname'=>'layui-icon layui-icon-video',
  'name'=>'视频',
  'toolbar'=>'video',
);

$record[]=array(
  'type'=>'dialog',
  'sidebar'=>$sidebar,
  'toolbar'=>$toolbar,
);
$A['onez']=array(
  'emojiList'=>json_decode('[[{"url":"100.gif","alt":"[微笑]"},{"url":"101.gif","alt":"[伤心]"},{"url":"102.gif","alt":"[美女]"},{"url":"103.gif","alt":"[发呆]"},{"url":"104.gif","alt":"[墨镜]"},{"url":"105.gif","alt":"[哭]"},{"url":"106.gif","alt":"[羞]"},{"url":"107.gif","alt":"[哑]"},{"url":"108.gif","alt":"[睡]"},{"url":"109.gif","alt":"[哭]"},{"url":"110.gif","alt":"[囧]"},{"url":"111.gif","alt":"[怒]"},{"url":"112.gif","alt":"[调皮]"},{"url":"113.gif","alt":"[笑]"},{"url":"114.gif","alt":"[惊讶]"},{"url":"115.gif","alt":"[难过]"},{"url":"116.gif","alt":"[酷]"},{"url":"117.gif","alt":"[汗]"},{"url":"118.gif","alt":"[抓狂]"},{"url":"119.gif","alt":"[吐]"},{"url":"120.gif","alt":"[笑]"},{"url":"121.gif","alt":"[快乐]"},{"url":"122.gif","alt":"[奇]"},{"url":"123.gif","alt":"[傲]"}],[{"url":"124.gif","alt":"[饿]"},{"url":"125.gif","alt":"[累]"},{"url":"126.gif","alt":"[吓]"},{"url":"127.gif","alt":"[汗]"},{"url":"128.gif","alt":"[高兴]"},{"url":"129.gif","alt":"[闲]"},{"url":"130.gif","alt":"[努力]"},{"url":"131.gif","alt":"[骂]"},{"url":"132.gif","alt":"[疑问]"},{"url":"133.gif","alt":"[秘密]"},{"url":"134.gif","alt":"[乱]"},{"url":"135.gif","alt":"[疯]"},{"url":"136.gif","alt":"[哀]"},{"url":"137.gif","alt":"[鬼]"},{"url":"138.gif","alt":"[打击]"},{"url":"139.gif","alt":"[bye]"},{"url":"140.gif","alt":"[汗]"},{"url":"141.gif","alt":"[抠]"},{"url":"142.gif","alt":"[鼓掌]"},{"url":"143.gif","alt":"[糟糕]"},{"url":"144.gif","alt":"[恶搞]"},{"url":"145.gif","alt":"[什么]"},{"url":"146.gif","alt":"[什么]"},{"url":"147.gif","alt":"[累]"}],[{"url":"148.gif","alt":"[看]"},{"url":"149.gif","alt":"[难过]"},{"url":"150.gif","alt":"[难过]"},{"url":"151.gif","alt":"[坏]"},{"url":"152.gif","alt":"[亲]"},{"url":"153.gif","alt":"[吓]"},{"url":"154.gif","alt":"[可怜]"},{"url":"155.gif","alt":"[刀]"},{"url":"156.gif","alt":"[水果]"},{"url":"157.gif","alt":"[酒]"},{"url":"158.gif","alt":"[篮球]"},{"url":"159.gif","alt":"[乒乓]"},{"url":"160.gif","alt":"[咖啡]"},{"url":"161.gif","alt":"[美食]"},{"url":"162.gif","alt":"[动物]"},{"url":"163.gif","alt":"[鲜花]"},{"url":"164.gif","alt":"[枯]"},{"url":"165.gif","alt":"[唇]"},{"url":"166.gif","alt":"[爱]"},{"url":"167.gif","alt":"[分手]"},{"url":"168.gif","alt":"[生日]"},{"url":"169.gif","alt":"[电]"},{"url":"170.gif","alt":"[炸弹]"},{"url":"171.gif","alt":"[刀子]"}],[{"url":"172.gif","alt":"[足球]"},{"url":"173.gif","alt":"[瓢虫]"},{"url":"174.gif","alt":"[翔]"},{"url":"175.gif","alt":"[月亮]"},{"url":"176.gif","alt":"[太阳]"},{"url":"177.gif","alt":"[礼物]"},{"url":"178.gif","alt":"[抱抱]"},{"url":"179.gif","alt":"[拇指]"},{"url":"180.gif","alt":"[贬低]"},{"url":"181.gif","alt":"[握手]"},{"url":"182.gif","alt":"[剪刀手]"},{"url":"183.gif","alt":"[抱拳]"},{"url":"184.gif","alt":"[勾引]"},{"url":"185.gif","alt":"[拳头]"},{"url":"186.gif","alt":"[小拇指]"},{"url":"187.gif","alt":"[拇指八]"},{"url":"188.gif","alt":"[食指]"},{"url":"189.gif","alt":"[ok]"},{"url":"190.gif","alt":"[情侣]"},{"url":"191.gif","alt":"[爱心]"},{"url":"192.gif","alt":"[蹦哒]"},{"url":"193.gif","alt":"[颤抖]"},{"url":"194.gif","alt":"[怄气]"},{"url":"195.gif","alt":"[跳舞]"}],[{"url":"196.gif","alt":"[发呆]"},{"url":"197.gif","alt":"[背着]"},{"url":"198.gif","alt":"[伸手]"},{"url":"199.gif","alt":"[耍帅]"},{"url":"200.png","alt":"[微笑]"},{"url":"201.png","alt":"[生病]"},{"url":"202.png","alt":"[哭泣]"},{"url":"203.png","alt":"[吐舌]"},{"url":"204.png","alt":"[迷糊]"},{"url":"205.png","alt":"[瞪眼]"},{"url":"206.png","alt":"[恐怖]"},{"url":"207.png","alt":"[忧愁]"},{"url":"208.png","alt":"[眨眉]"},{"url":"209.png","alt":"[闭眼]"},{"url":"210.png","alt":"[鄙视]"},{"url":"211.png","alt":"[阴暗]"},{"url":"212.png","alt":"[小鬼]"},{"url":"213.png","alt":"[礼物]"},{"url":"214.png","alt":"[拜佛]"},{"url":"215.png","alt":"[力量]"},{"url":"216.png","alt":"[金钱]"},{"url":"217.png","alt":"[蛋糕]"},{"url":"218.png","alt":"[彩带]"},{"url":"219.png","alt":"[礼物]"}]]',1),
  'info'=>array(
    'upload_url'=>onez('factory.form')->url.'/php/fileupload.php?sitetoken='.$G['this']->token,
    'style_icon_my_voice'=>'width:20px;height:20px',
    'style_icon_other_voice'=>'width:20px;height:20px',
    'style_icon_close'=>'width:20px;height:20px;border:0;margin:10px',
    'style_my_bubble'=>'background-color:#0099ff',
    'input_adjust_position'=>true,
    'input_hold_keyboard'=>false,
    'input_confirm_hold'=>false,
    'input_confirm_type'=>'提交',
  ),
  'images'=>array(
    //红包背景
    'redEnvelopeChat'=>onez('factory.im')->url.'/images/dialog/red-envelope-chat.png',
    //红包消息中的小图标
    'redEnvelope'=>onez('factory.im')->url.'/images/dialog/red-envelope.png',
    //表情目录需配合图标列表
    'emoji_path'=>onez('factory.im')->url.'/images/dialog/emoji/',
  ),
  'me'=>array(
    'userid'=>$G['userid'],
    'nickname'=>$G['this']->user($G['userid'],'nickname'),
    'avatar'=>$G['this']->avatar($G['userid']),
  ),
);